### Problem 1

### 1a

For this question we are going to use out Temp.csv. This file contains a column of 6 cities, a column of their states and a column of their respective temperatures. 

Read the file into a dataframe and name it Temp.

### Answer

In [26]:
# Lets start by importing the appropriate packages
import pandas as pd

# Now lets read it into a data frame and call it Temp
Temp = pd.read_csv('Temp.csv')

# Print the dataframe
Temp

         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68

### 1b

Add New Heaven, Connecticut with a pemperature of 58 degrees to the Temp data frame

### Answer

In [27]:
# Lets start by creating a new data frame newDT with the new information 
# and name the columns same as the Temp columns
newDF = pd.DataFrame([['New Heaven', 'Connecticut', 58]], columns = Temp.columns)

# Print our new data frame
print(newDF)

# Print some stars to separate
print('*'*50)

# Since we have the same column names we can use concat to add the new
# data frame to the Temp data frame
Temp = pd.concat([Temp, newDF], axis = 0)

# Print our new data frame
print(Temp)

# NOTE: Remember, every time you run this snippet, a new row will be added
# to the Temp data frame since we are using concat

         City        State  Temperature
0  New Heaven  Connecticut           58
**************************************************
         City        State  Temperature
0         NYC     New York           67
1      Albany     New York           49
2     Buffalo     New York           38
3    Hartford  Connecticut           63
4  Bridgeport  Connecticut           58
5      Treton   New Jersey           72
6      Newark   New Jersey           68
0  New Heaven  Connecticut           58

### 1c

Replace the name of the states by their Abbreviations on the Temp dafa frame.<br>

New York -> NY<br>
Connecticut -> CT<br>
New Jersey -> NJ

### Answer

In [31]:
# We are going to use panda's replace to tackle this problem
Temp.replace(['New York', 'Connecticut', 'New Jersey'], ['NY', 'CT', 'NJ'], inplace = True)

# Print our new data frame
Temp

         City State  Temperature
0         NYC    NY           67
1      Albany    NY           49
2     Buffalo    NY           38
3    Hartford    CT           63
4  Bridgeport    CT           58
5      Treton    NJ           72
6      Newark    NJ           68
0  New Heaven    CT           58

### 1d

Select only the rows of New York

### Answer

In [34]:
# Use Panda's loc to locate the desired rows
Temp.loc[Temp.State == 'NY']

      City State  Temperature
0      NYC    NY           67
1   Albany    NY           49
2  Buffalo    NY           38

### 1e

What is the average of the temperatures in the cities of NY?

### Answer

In [35]:
# For this problem we are going to locate the temperatures and then 
# use mean() to get the average
Temp.loc[Temp.State == 'NY', 'Temperature'].mean()

51.333333333333336

### 1f

Find the mean and standard deviation of the temperatures of all three states

In [46]:
# For this we are going to use Panda's groupby to get a table of the states
GBtemp = Temp.groupby('State')

# Print this new table using count()
print(GBtemp.count())

# Print some stars to separate
print('*'*50)

# Now lets use agg to get the mean and standard deviation
GBtemp.agg(['mean', 'std'])

       City  Temperature
State
CT        3            3
NJ        2            2
NY        3            3
**************************************************

      Temperature
             mean        std
State
CT      59.666667   2.886751
NJ      70.000000   2.828427
NY      51.333333  14.640128

### 1g

The capitals of each city are:

Connecticut -> Hartford<br>
New York -> Albany<br>
New Jersey -> Trenton

Create a new dataframe called Capital with only two columns: State and Capital

### Answer

In [58]:
# For this one we will make a data frame from scratch using Panda's DataFrame
Capital = pd.DataFrame({'State':['NY', 'NJ', 'CT'],
                       'Capital':['Albany', 'Trenton', 'Hartford']})
Capital

    Capital State
0    Albany    NY
1   Trenton    NJ
2  Hartford    CT

### 1h

Add a new boolean column to Temp, where it is True if the city is the capital of the state, otherwise False

### Answer

In [63]:
# First lets start by adding the data frame Capital to our Temp data frame using Panda's merge
capTemp = pd.merge(Temp, Capital, on='State')

# Now lets change the Capital column to a boolian by using a logical statement 
capTemp['Capital'] = (capTemp['Capital'] == capTemp['City'])

# Lets print our new data frame
capTemp

         City State  Temperature  Capital
0         NYC    NY           67    False
1      Albany    NY           49     True
2     Buffalo    NY           38    False
3    Hartford    CT           63     True
4  Bridgeport    CT           58    False
5  New Heaven    CT           58    False
6      Treton    NJ           72    False
7      Newark    NJ           68    False

### Problem 2

### 2a

Load the Gross Domestic Product data for the 190 countries ranked in the GDP.csv file.

### Answer

In [17]:
#Lets start by importing the packages we will need for this Exercise 
import numpy as np
import pandas as pd

# So this is a very interesting file that can give us some problems to read but fortunately
# Pandas's read_csv has pretty much a solution for everything.

# We use pd.read_csv to read the file, we notice that the first 4 rows and the header contain no information
# what so ever so we use skiprows to skip them. we notice that the only columns that actually contain information 
# are the columns 0, 1, 3 and four so we use usecols to only download those columns. There are a lot of columns 
# that have a lot of N/As towards the end so we only select the 189 relevant ones. Finally for this file we are
# going to need an encoder if you are using a mac which i am, hence we use encoding.
gdp = pd.read_csv('GDP.csv', skiprows = range(5), usecols = [0,1,3,4], nrows = 189, encoding='ISO-8859-1')

# Now lets use .columns to rename our four columns, make it look pretty
gdp.columns = ['CountryCode', 'Rank', 'CountryName', 'GDP']

# And if you saw the data before cleaning it up, you will be surprised how clean it looks now.
# Lets have a look at the first 5 columns
gdp.head()

  CountryCode  Rank     CountryName          GDP
0         CHN     2           China   8,227,103
1         JPN     3           Japan   5,959,718
2         DEU     4         Germany   3,428,131
3         FRA     5          France   2,612,878
4         GBR     6  United Kingdom   2,471,784

### 2b

Load the Country.csv file into a data frame

In [23]:
# Similar to GDP, we use pd.read_csv to read the file and then use the encoder
country = pd.read_csv('Country.csv', encoding='ISO-8859-1')

# Lets have a look at the data frame
country.head()

,CountryCode,Long Name,Income Group,Region,Lending category,Other groups,Currency Unit,Latest population census,Latest household survey,Special Notes,...,Source of most recent Income and expenditure data,Vital registration complete,Latest agricultural census,Latest industrial data,Latest trade data,Latest water withdrawal data,2-alpha code,WB-2 code,Table Name,Short Name
0,ABW,Aruba,High income: nonOECD,Latin America & Caribbean,NaN,NaN,Aruban florin,2000,NaN,NaN,...,NaN,NaN,NaN,NaN,2008.0,NaN,AW,AW,Aruba,Aruba
1,ADO,Principality of Andorra,High income: nonOECD,Europe & Central Asia,NaN,NaN,Euro,Register based,NaN,NaN,...,NaN,Yes,NaN,NaN,2006.0,NaN,AD,AD,Andorra,Andorra
2,AFG,Islamic State of Afghanistan,Low income,South Asia,IDA,HIPC,Afghan afghani,1979,"MICS, 2003",Fiscal year end: March 20; reporting period fo...,...,NaN,NaN,NaN,NaN,2008.0,2000.0,AF,AF,Afghanistan,Afghanistan
3,AGO,People's Republic of Angola,Lower middle income,Sub-Saharan Africa,IDA,NaN,Angolan kwanza,1970,"MICS, 2001, MIS, 2006/07",NaN,...,"IHS, 2000",NaN,1964-65,NaN,1991.0,2000.0,AO,AO,Angola,Angola
4,ALB,Republic of Albania,Upper middle income,Europe & Central Asia,IBRD,NaN,Albanian lek,2001,"MICS, 2005",NaN,...,"LSMS, 2005",Yes,1998,2005.0,2008.0,2000.0,AL,AL,Albania,Albania

### 2c

Match the data based on the country shortcode.

### Answer

In [27]:
# So we are going to merge both data frames on CountryCode using pandas merge
gdpMerged = pd.merge(gdp, country, on = 'CountryCode')

# Lets see what we got
gdpMerged.head()

,CountryCode,Rank,CountryName,GDP,Long Name,Income Group,Region,Lending category,Other groups,Currency Unit,...,Source of most recent Income and expenditure data,Vital registration complete,Latest agricultural census,Latest industrial data,Latest trade data,Latest water withdrawal data,2-alpha code,WB-2 code,Table Name,Short Name
0,CHN,2,China,"8,227,103",People's Republic of China,Lower middle income,East Asia & Pacific,IBRD,NaN,Chinese yuan,...,"IHS, 2005",NaN,1997,2005.0,2008.0,2000.0,CN,CN,China,China
1,JPN,3,Japan,"5,959,718",Japan,High income: OECD,East Asia & Pacific,NaN,NaN,Japanese yen,...,"IS, 1993",Yes,2000,2004.0,2008.0,2000.0,JP,JP,Japan,Japan
2,DEU,4,Germany,"3,428,131",Federal Republic of Germany,High income: OECD,Europe & Central Asia,NaN,Euro area,Euro,...,"IHS, 2000",Yes,1999-2000,2004.0,2008.0,2000.0,DE,DE,Germany,Germany
3,FRA,5,France,"2,612,878",French Republic,High income: OECD,Europe & Central Asia,NaN,Euro area,Euro,...,"ES/BS, 1994/95",Yes,1999-2000,2004.0,2008.0,2000.0,FR,FR,France,France
4,GBR,6,United Kingdom,"2,471,784",United Kingdom of Great Britain and Northern I...,High income: OECD,Europe & Central Asia,NaN,NaN,Pound sterling,...,"IS, 1999",Yes,1999-2000 (conducted annually),2004.0,2008.0,2000.0,GB,GB,United Kingdom,United Kingdom

### 2d

How many of the IDs match?

### Answer

In [30]:
# For this question we can just use the shape of the data frame which will tell us how many columns
# and rows it has, since we've been asked for just the columns we get the first number = 0
gdpMerged.shape[0]

188